app/controllers/api/api_controller.rb

    def ai_fact
      image = Image.find(params[:image_id])
      was_cached = image.ai_fact.present?
---
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def rate_image
      image = Image.find(params[:image_id])
      rating = params[:value].to_i
      value_record = current_user.values.find_or_initialize_by(image_id: image.id)
      is_new_record = value_record.new_record?
      value_record.value = rating

      if value_record.save
        image.recalculate_ave_value!
        image.reload
        message_key = is_new_record ? 'api.rate_image.created' : 'api.rate_image.updated'

        render json: {
          status: 'success',
          message: I18n.t(message_key),
          new_average: image.ave_value,
          new_total_values: image.values.count,
          theme_values_count: theme_values_count(image.theme_id),
          common_ave_value: image.ave_value,
          user_value: value_record.value,
          user_valued: true,
          updated: !is_new_record
---
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "values".* FROM "values" WHERE "values"."user_id" = $1 AND "values"."image_id" = $2 LIMIT $3  [["user_id", 1], ["image_id", 1], ["LIMIT", 1]]
SELECT AVG("values"."value") FROM "values" WHERE "values"."image_id" = $1  [["image_id", 1]]
UPDATE "images" SET "ave_value" = $1, "updated_at" = $2 WHERE "images"."id" = $3  [["ave_value", 5.0], ["updated_at", "2026-05-19 04:31:20.139412"], ["id", 1]]
UPDATE "values" SET "value" = $1, "updated_at" = $2 WHERE "values"."id" = $3  [["value", 4], ["updated_at", "2026-05-19 04:33:03.532283"], ["id", 1]]
SELECT COUNT(*) FROM "values" WHERE "values"."image_id" = $1  [["image_id", 1]]
SELECT COUNT(*) FROM "images" WHERE "images"."theme_id" = $1  [["theme_id", 2]]
SELECT "images".* FROM "images" WHERE "images"."theme_id" = $1 ORDER BY "images"."id" ASC LIMIT $2 OFFSET $3  [["theme_id", 2], ["LIMIT", 1], ["OFFSET", 0]]