app/controllers/api/api_controller.rb

SELECT "values".* FROM "values" WHERE "values"."user_id" = $1 AND "values"."image_id" = $2 LIMIT $3  [["user_id", 1], ["image_id", 1], ["LIMIT", 1]]
UPDATE "values" SET "value" = $1, "updated_at" = $2 WHERE "values"."id" = $3  [["value", 3], ["updated_at", "2026-05-19 04:48:34.192573"], ["id", 1]]
---
    def rate_image
      image = Image.find(params[:image_id])
      rating = params[:value].to_i
      value_record = current_user.values.find_or_initialize_by(image_id: image.id)
      is_new_record = value_record.new_record?
      value_record.value = rating

      if value_record.save