app/views/themes/index.html.haml

          %td= theme.name
          %td= theme.images.size
---
SELECT "images".* FROM "images" WHERE "images"."theme_id" IN ($1, $2, $3, $4)  [["theme_id", 1], ["theme_id", 2], ["theme_id", 4], ["theme_id", 3]]