app/views/values/index.html.haml

SELECT "values".* FROM "values"
---
        %td= value.image_id
        %td= value.value