app/views/values/index.html.haml

SELECT "values".* FROM "values"
SELECT "images".* FROM "images" WHERE "images"."id" IN ($1, $2, $3, $4)  [["id", 4], ["id", 2], ["id", 3], ["id", 1]]
SELECT COUNT(*) FROM "values" WHERE "values"."image_id" = $1  [["image_id", 4]]
---
          %td= value.image.name
          %td= value.value
          %td= value.image.values.size