app/helpers/sessions_helper.rb

  def sign_in(user)
    remember_token = User.new_remember_token
    cookies.permanent[:remember_token] = remember_token
    user.update_attribute(:remember_token, User.encrypt(remember_token))
---
UPDATE "users" SET "updated_at" = $1, "remember_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2026-05-18 21:18:39.683288"], ["remember_token", "f0aa9abc5b9d411be6475fce062c35bbee999989"], ["id", 2]]

  def current_user
    remember_token = User.encrypt(cookies[:remember_token])
    @current_user ||= User.find_by(remember_token: remember_token)
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = $1 LIMIT $2  [["remember_token", "da39a3ee5e6b4b0d3255bfef95601890afd80709"], ["LIMIT", 1]]

  def sign_out
    current_user.update_attribute(:remember_token, User.encrypt(User.new_remember_token)) if current_user
---
UPDATE "users" SET "updated_at" = $1, "remember_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2026-05-18 21:19:24.374270"], ["remember_token", "695a94b6f0cb94510a544fb7cebfd89701f6b6d6"], ["id", 2]]