app/controllers/images_controller.rb

SELECT "images".* FROM "images" ORDER BY "images"."name" ASC
SELECT "themes".* FROM "themes" WHERE "themes"."id" IN ($1, $2)  [["id", 2], ["id", 4]]
SELECT "values".* FROM "values" WHERE "values"."image_id" IN ($1, $2, $3, $4)  [["image_id", 1], ["image_id", 4], ["image_id", 2], ["image_id", 3]]
---
  def index
    @images = Image.includes(:theme, :values).order(:name)

SELECT "values".* FROM "values" WHERE "values"."user_id" = $1 AND "values"."image_id" IN ($2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18)
---
  def load_user_ratings(images)
    return {} unless signed_in?

    Value.where(user_id: current_user.id, image_id: images.map(&:id)).index_by(&:image_id)