app/controllers/main_controller.rb

  def index
    @themes_count = Theme.count
    @images_count = Image.count
---
SELECT COUNT(*) FROM "themes"
SELECT COUNT(*) FROM "images"