app/controllers/themes_controller.rb

SELECT "images".* FROM "images" WHERE "images"."theme_id" IN ($1, $2, $3, $4)  [["theme_id", 1], ["theme_id", 2], ["theme_id", 4], ["theme_id", 3]]
SELECT "themes".* FROM "themes" ORDER BY "themes"."name" ASC
---
  def index
    @themes = Theme.includes(:images).order(:name)

INSERT INTO "themes" ("name", "qty_items", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Новая тема"], ["qty_items", nil], ["created_at", "2026-05-19 06:28:10.011927"], ["updated_at", "2026-05-19 06:28:10.011927"]]
---
  def create
    @theme = Theme.new(theme_params)

    respond_to do |format|
      if @theme.save

DELETE FROM "themes" WHERE "themes"."id" = $1  [["id", 5]]
---
  def destroy
    @theme.destroy!

SELECT "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_theme
    @theme = Theme.find(params[:id])