app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2026-05-19 06:40:27.645346"], ["id", 1]]
---
  def update_avatar
    @user = current_user
    if @user.update(avatar_params)

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT COUNT(*) FROM "values" WHERE "values"."user_id" = $1  [["user_id", 1]]
---
  def load_profile_data
    @user = current_user
    @values_count = @user.values.count