app/controllers/values_controller.rb

SELECT "themes".* FROM "themes" WHERE "themes"."id" IN ($1, $2)  [["id", 2], ["id", 4]]
SELECT "values".* FROM "values" WHERE "values"."user_id" = $1 ORDER BY "values"."created_at" DESC  [["user_id", 1]]
---
  def index
    @values = current_user.values.includes(image: :theme).order(created_at: :desc)

INSERT INTO "values" ("user_id", "image_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["image_id", 5], ["value", 5], ["created_at", "2026-05-19 06:28:36.571718"], ["updated_at", "2026-05-19 06:28:36.571718"]]
---
  def create
    @value = current_user.values.build(value_params)

    respond_to do |format|
      if @value.save

SELECT "values".* FROM "values" WHERE "values"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_value
    @value = Value.find(params[:id])