app/controllers/work_controller.rb

  def fallback_theme_data(theme_record)
    theme_id = theme_record.id
    {
      values_qty: Value.count,
      file: WorkImage::PLACEHOLDER_FILE,
      image_id: nil,
      name: t('work.index.no_images_in_theme'),
      current_user_id: current_user.id,
      user_valued: 0,
      common_ave_value: 0,
      value: 0,
      theme_id: theme_id,
      images_arr_size: 0,
      image_values_count: 0,
      theme_values_count: theme_values_count(theme_id),
      page: 1,
      total_pages: 0,
      first_page: true,
      last_page: true,
      idle: false,
      no_images: true
---
SELECT COUNT(*) FROM "values"