app/controllers/work_controller.rb

  def index
    @images_count = Image.all.count
    @selected_theme = t('work.index.select_theme')
    @selected_image_name = 'радуга'
    @values_qty = Value.all.count
---
SELECT COUNT(*) FROM "images"
SELECT COUNT(*) FROM "values"

  def choose_theme
    @themes = Theme.all.pluck(:name)
---
SELECT "themes"."name" FROM "themes"

  def display_theme
    if params[:theme].blank? || params[:theme] == "---"
      theme = t('work.index.select_theme')
      theme_id = 1
      values_qty = Value.count
      data = {
        index: 0, name: 'радуга', values_qty: values_qty,
        file: WorkImage::PLACEHOLDER_FILE, image_id: nil,
        current_user_id: current_user.id, user_valued: 0,
        common_ave_value: 0, value: 0, theme_id: theme_id, images_arr_size: 0
      }
    else
      theme = params[:theme]
      theme_id = Theme.find_by(name: theme).id
---
SELECT COUNT(*) FROM "values"
SELECT "themes".* FROM "themes" WHERE "themes"."name" = $1 LIMIT $2  [["name", "Какое из превращений Блум Вам нравится больше?"], ["LIMIT", 1]]