app/models/image.rb

SELECT AVG("values"."value") FROM "values" WHERE "values"."image_id" = $1  [["image_id", 1]]
---
  def recalculate_ave_value!
    avg = values.average(:value)