app/controllers/concerns/work_image.rb

  def theme_values_count(theme_id)
    return 0 if theme_id.blank?

    Value.joins(:image).where(images: { theme_id: theme_id }).count
---
SELECT COUNT(*) FROM "values" INNER JOIN "images" ON "images"."id" = "values"."image_id" WHERE "images"."theme_id" = $1  [["theme_id", 2]]