app/views/images/index.html.haml

SELECT "values".* FROM "values" WHERE "values"."image_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17)
---
          %td= image.theme&.name || t('.no_theme')
          %td= image.values.size